AcDbIBLBackground.secondaryBackground
Gets the background to display when DisplayImage is set to false
Returns:
Background db Id

AcDbIBLBackground.setSecondaryBackground(AcDbObjectId!System.Runtime.CompilerServices.IsConst)
Sets the background to display when DisplayImage is set to false
Limited to 2D backgrounds only - Solid, Gradient, Image
Remarks:
Ownership of secondary background is not assumed.
Cloning an AcDbIBLBackground will result in two backgrounds sharing the same secondary background
bg:
Background db Id

AcDbIBLBackground.displayImage
Gets whether to display the IBL image as the background
Returns:
True if IBL image is to be displayed as background

AcDbIBLBackground.setDisplayImage(System.Boolean!System.Runtime.CompilerServices.IsConst)
Sets whether to display the IBL image as the background
bdisplay:
Set to true to display IBL image in background

AcDbIBLBackground.rotation
Gets the rotation value for the IBL image
Returns:
Rotation value in degrees

AcDbIBLBackground.setRotation(System.Double!System.Runtime.CompilerServices.IsConst)
Sets the rotation value for the IBL image
-180 to 180 degrees
rotation:
Rotation value in degrees (-180 to 180)

AcDbIBLBackground.IBLImageName
Gets the image used for IBL
Returns:
Name of IBL image

AcDbIBLBackground.setIBLImageName(AcString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Sets the image used for IBL
name:
Name of IBL image

AcDbIBLBackground.enable
Gets whether IBL is currently active
Returns:
Name of IBL image

AcDbIBLBackground.setEnable(System.Boolean!System.Runtime.CompilerServices.IsConst)
Sets whether IBL is currently active
When disabled, the background will be default black transparent
name:
Name of IBL image

AcDbIBLBackground.Dispose
Destructor.

AcDbIBLBackground.#ctor
Constructor.

AcDbIBLBackground
Image based lighting background